{
  "title": "Hiring at Tivix. What we select for.",
  "author": "Francis Cleary",
  "postDate": "4/10/16",
  "imageUrl": "/uploads/images/1601_Tivix_1153.max-256x256.jpg",
  "content": "<p>A consulting business is only as good as its ability to recruit the right talent and create <b>teams that are greater than the sum of their parts</b>. That's it. If we can't do that, we'll be out of business tomorrow.&nbsp;</p><p><a href='http://www.tivix.com/blog/our-hiring-secrets-disclosed/'>I've written before about our hiring process</a> at Tivix but I thought it would be useful to try to articulate exactly what we are selecting for as we add teammates:</p><p></p><ul><li><b>Lifelong Learning Skills.<br></b>Successful people have the habits of lifelong learners. We live in a world where the velocity of change is ferocious. We need ferocious learners.</li><p></p><p></p><li><b>Humility.<br></b>We want people who are curious, but not critical. People who know that admitting what you don't know <b>shows how much you do know</b>. As Elon Musk says, every day&nbsp;<em>'You should take the approach that you're wrong. Your goal should be to be less wrong.'</em> At Tivix we believe in this and celebrate it internally.&nbsp;<p></p></li><p></p><li><b>Listening skills.<br></b>Someone who talks all their way through their interview will never get a job at Tivix. Listening skills matter, and asking good questions matters. As Richard Branson says, <em>'Success in business means successfully solving problems. Solving problems means listening.'</em><p></p></li><p></p><li><b>Engineering Mindset.<br></b>At Tivix, we build things for a living. So we do well with teammates who have been passionate about building things since before they could walk. An engineering mindset requires pattern finding skills, a healthy skepticism for the status quo and an endless obsession with building better solutions. &nbsp;<p></p></li><li><p><b>Communication Skills.<br></b>The best way to never get an interview at Tivix is to write us a crappy cover letter. The best way to never get a second interview is to not send us a well-crafted follow-up letter after the first interview. Great teams know how to communicate clearly, internally and externally. And that requires writing skills and social etiquette. It just does.</p></li><p></p><p></p><li><b>Empathy.<br></b>If you read any of <a href='https://hbr.org/2015/04/a-process-for-empathetic-product-design'>the leading thinking on product development</a> today you'll read about how successful product development is moving away from an inward focus on technology to an <b>empathetic focus on the people who will use it</b>. That's easier for some engineers than others. It's a hard trait to select for, but if we get a resume from a candidate who has done field work for a nonprofit in East Africa or has been passionately involved with other social causes, that can be a clue for us that empathetic thinking is present.&nbsp;<p></p></li></ul><p>Of course, in the end we need team chemistry. And predicting chemistry is as difficult in hiring as it is in dating. But we've found that if we are successful in selecting for the six traits above, the chemistry will take care of itself.&nbsp;</p><p><br></p>"
}
